// Напишите программу, которая принимает на вход пятизначное 
// число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да


Console.WriteLine("Введите число N");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(" ");

for (n < 100000; n > 9999)
{
    




    Console.WriteLine("Число N должно быть больше 0");
}
else
{
    for (int i = 1; i <= n; i++)
    {
        Console.WriteLine(i * i * i);
    }

}